{
    "HF955": {
        "DESCRIPTION": "Financial assurance required for feedlot permits, inventories and reports required, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0955&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": " Subd. 7f.\nFinancial assurance.\n(a) Before the commissioner issues or renews a permit  for a feedlot with a capacity of 1,000 or more animal units, the permit applicant must submit  to the commissioner proof of financial assurance that satisfies the requirements under this  subdivision. Financial assurance must be of an amount sufficient to pay the closure costs  determined under paragraph (c) for the feedlot and manure storage area, with all terms and  conditions of the financial assurance instrument approved by the commissioner. The  commissioner, in evaluating financial assurance, may consult individuals with documented  experience in the analysis. The applicant must pay all costs incurred by the commissioner  to obtain the analysis.\n (b) A permittee must maintain sufficient financial assurance for the duration of the permit  and demonstrate to the commissioner's satisfaction that:\n (1) money will be available and made payable to the commissioner if the commissioner  determines the permittee is not in full compliance with the closure requirements established  by the commissioner in rule for feedlots and manure storage areas;\n (2) the financial assurance instrument is fully valid, binding, and enforceable under state  and federal law;\n (3) the financial assurance instrument is not dischargeable through bankruptcy; and\n (4) the financial assurance provider will give the commissioner at least 120 days' notice  before canceling the financial assurance instrument.\n (c) The permit applicant must submit to the commissioner a documented estimate of  costs required to implement the closure requirements established by the commissioner in  rule for feedlots and manure storage areas. Cost estimates must incorporate current dollar  values at the time of the estimate and any additional costs required by the commissioner to  oversee and hire a third party to implement the closure requirements. The applicant must  not incorporate the estimated salvage or market value of manure, animals, structures,  equipment, land, or other assets. The commissioner must evaluate and may modify the  applicant's cost estimates and may consult individuals with documented experience in feedlot  or manure storage area closure or remediation. The applicant must pay all costs incurred  by the commissioner to obtain the consultation.\n Subd. 7g.\nAbandoned manure storage areas.\nAt least annually, the commissioner must  compile a list of abandoned manure storage areas in the state. A list compiled under this  subdivision is not a feedlot inventory for purposes of subdivision 7b. For purposes of this  subdivision, \"abandoned manure storage areas\" means solid and liquid manure storage areas  that have been previously registered with the state as a feedlot with a manure storage area  and have:\n (1) permanently ceased operation and are subject to, but not in compliance with, the  closure requirements established by the commissioner in rule for feedlots and manure storage  areas; or\n (2) been unused for at least three years.\nFEEDLOT FINANCIAL ASSURANCE REQUIREMENTS COMPLIANCE  SCHEDULE.\n The commissioner of the Pollution Control Agency may phase in the new financial  assurance requirements under Minnesota Statutes, section 116.07, subdivision 7f, during  the next reissuance of the national pollutant discharge elimination system general permit  for concentrated animal feeding operations, MNG440000. The commissioner must establish  a schedule for permittees to come into compliance with the requirements. The schedule  must require 250 permittees per year to comply, beginning with the operations with the  largest number of animal units.\nMANURE STORAGE AREA REPORTS REQUIRED.\n Subdivision 1.\nReports.\n(a) No later than December 15, 2023, the commissioner of the  Pollution Control Agency must develop a list based on registration data for each county of  potentially abandoned manure storage areas.\n (b) No later than January 15, 2025, each delegated county must report to the commissioner  of the Pollution Control Agency a list of abandoned manure storage areas located in the  county. The report must be submitted by the county feedlot officer.\n (c) No later than January 15, 2025, the Pollution Control Agency regional feedlot staff  must compile a list of abandoned manure storage areas located in counties under their  regulatory jurisdiction that do not have delegation agreements with the agency.\n (d) No later than February 15, 2025, the commissioner of the Pollution Control Agency  must submit a compilation report and list of abandoned manure storage areas to the legislative  committees with jurisdiction over agriculture and environment. The report must include  recommendations for remediation. The commissioner must seek advice from the Minnesota  Association of County Feedlot Officers and livestock associations for recommendations,  including existing and any proposed options for remediation.\n (e) For purposes of this section, \"abandoned manure storage areas\" has the meaning  given in Minnesota Statutes, section 116.07, subdivision 7g.\n (f) Reports and lists required under this section are not feedlot inventories for purposes  of Minnesota Statutes, section 116.07, subdivision 7b.\n Subd. 2.\nDelegated counties.\n(a) Except as provided in paragraph (b), during the 2023  and 2024 delegation years, the commissioner of the Pollution Control Agency must not  penalize a delegated county for a performance issue or shortcoming attributable to the  county's reassignment of county feedlot officer resources necessary to comply with the  additional requirements imposed upon the county under subdivision 1.\n (b) The commissioner may penalize a county during the 2023 or 2024 delegation year  for a performance issue or shortcoming attributable to the county's reassignment of county  feedlot officer resources only if the specific penalty is approved by a majority of the board  of the Minnesota Association of County Feedlot Officers.\nAPPROPRIATIONS.\n Subdivision 1.\nGeneral fund.\n(a) $250,000 in fiscal year 2024 and $250,000 in fiscal  year 2025 are appropriated from the general fund to the commissioner of the Pollution  Control Agency to implement feedlot financial assurance requirements and compile the  annual list of abandoned manure storage areas under Minnesota Statutes, section 116.07,  subdivisions 7f and 7g.\n (b) $700,000 in fiscal year 2024 is appropriated from the general fund to the commissioner  of the Pollution Control Agency for distribution to delegated counties based on registered  feedlots and manure storage areas for inspections of manure storage areas and the abandoned  manure storage area reports required under this act. This is a onetime appropriation and is  available until June 30, 2025.\n (c) $250,000 in fiscal year 2024 is appropriated from the general fund to the commissioner  of the Pollution Control Agency for a grant to the Minnesota Association of County Feedlot  Officers to provide training on state feedlot requirements, working efficiently and effectively  with producers, and reducing the incidence of manure or nutrients entering surface water  or groundwater.\n Subd. 2.\nEnvironmental fund.\n$250,000 in fiscal year 2024 and $250,000 in fiscal year  2025 are appropriated from the environmental fund to the commissioner of the Pollution  Control Agency to implement feedlot financial assurance requirements and compile the  annual list of abandoned manure storage areas under Minnesota Statutes, section 116.07,  subdivisions 7f and 7g.\n"
    },
    "HF911": {
        "DESCRIPTION": "Board of Animal Health modified.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0911&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": " 11\n two at-large members, one member who is a member of a federally recognized  Tribe located in Minnesota, and eight regional members, with no two regional members  residing in the same congressional district. To the extent practicable, the governor's  appointments must achieve gender balance among the board membership. Members must  be knowledgeable in animal agriculture, animal health, or pets and companion animals,  with at least two members who represent the public and are not employed in agriculture,  veterinary medicine, the pet industry, or a related field\n shall\n. The governor shall appoint\n the board's\n EFFECTIVE DATE.\nThis section is effective July 1, 2023, and applies to appointments  that occur on or after that date.\n"
    },
    "HF860": {
        "DESCRIPTION": "Local food promotion and education event funding provided, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0860&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "APPROPRIATION.\n $25,000 in fiscal year 2024 and $25,000 in fiscal year 2025 are appropriated from the  general fund to the commissioner of agriculture for grants to the Southern Minnesota  Initiative Foundation to promote local foods through an annual event that raises public  awareness of local foods and connects local food producers and processors with potential  buyers.\n"
    },
    "HF798": {
        "DESCRIPTION": "Future of Advanced Agriculture Research in Minnesota facilities funding provided, bonds issued, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0798&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "FUTURE OF ADVANCED AGRICULTURE RESEARCH IN  MINNESOTA.\n Subdivision 1.\nAppropriation.\n$60,000,000 is appropriated from the bond proceeds  fund to the Board of Regents of the University of Minnesota to acquire land, predesign,  design, construct, furnish, and equip new facilities in Mower County to house the Future  of Advanced Agriculture Research in Minnesota (FAARM) program that will support an  integrated science approach to addressing interaction of soil, water, plant, animal,  environmental, and human health in a managed research and education system. The facilities  will include classroom and laboratory space, animal housing, and equipment storage space  and space for associated supportive functions. This appropriation is available when the  commissioner of management and budget determines that an amount sufficient to complete  the project has been committed to the project.\n Subd. 2.\nBond sale.\nTo provide the money appropriated in this section from the bond  proceeds fund, the commissioner of management and budget shall sell and issue bonds of  the state in an amount up to $60,000,000 in the manner, upon the terms, and with the effect  prescribed by Minnesota Statutes, sections 16A.631 to 16A.675, and the Minnesota  Constitution, article XI, sections 4 to 7.\n EFFECTIVE DATE.\nThis section is effective the day following final enactment.\n"
    },
    "HF695": {
        "DESCRIPTION": "Agriculture-related business assistance funding provided, reports required, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0695&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "APPROPRIATIONS; BUSINESS ASSISTANCE GRANTS.\n (a) $300,000 in fiscal year 2024 and $300,000 in fiscal year 2025 are appropriated from  the general fund to the commissioner of agriculture for grants to GreenSeam for assistance  to agriculture-related businesses to support business retention and development, business  attraction and creation, talent development and attraction, and regional branding and  promotion. These are onetime appropriations.\n (b) No later than December 1, 2024, and December 1, 2025, GreenSeam must report to  the chairs and ranking minority members of the legislative committees with jurisdiction  over agriculture and rural development with information on new and existing businesses  supported, net new jobs in the region, new educational partnerships and programs supported,  and regional branding and promotional efforts.\n"
    },
    "HF525": {
        "DESCRIPTION": "Owners of agricultural land, real property that is both nonhomesteaded and noncommercial, or small business property allowed to vote on levy or bond referendums where property is located, and constitutional amendment proposed.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0525&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "CONSTITUTIONAL AMENDMENT PROPOSED.\n An amendment to the Minnesota Constitution is proposed to the people. If the amendment  is adopted, article VII, section 1, will read:\nIn addition, every person 18 years of age  or more who has been a citizen of the United States and resident of this state for three months  and who is the owner of nonhomesteaded agricultural land, real property that is both  nonhomesteaded and noncommercial, or commercial or industrial real property on which  the owner conducts a small business as defined by law may vote in the precinct where the  real property is located on any question concerning a local levy or bond referendum. \nSUBMISSION TO VOTERS.\n The proposed amendment must be submitted to the people at the 2024 general election.  The question submitted must be:\n \"Shall the Minnesota Constitution be amended to allow a person who owns certain land  in a precinct but is not a resident of the precinct to vote on local levy or bond referendums  in the precinct where the land is located?\n\n \nYes \n.\n\n\n\n \nNo \n.\n\"\n\n\n"
    },
    "HF519": {
        "DESCRIPTION": "Motor vehicle inspection requirement exemptions established for farm vehicles.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0519&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": " (c) This section does not apply to a farm work truck that is:\n (1) operated in intrastate commerce;\n (2) used in the transportation of anhydrous ammonia to a farm for on-farm use, or from  a farm; and\n (3) not otherwise used in the transportation of hazardous materials of a type or quantity  that requires the vehicle to be placarded in accordance with Code of Federal Regulations,  title 49, section 172.504.\n (d) For purposes of paragraph (c), \"farm work truck\" means a farm truck, as defined in  section 168.002, subdivision 8, excluding a trailer or semitrailer, or a full-size pickup truck  that meets the requirements for a farm truck under section 168.002, subdivision 8, paragraph  (a), that is registered under section 168.013, subdivision 1a, 1c, or 1e.\n (d) This section does not apply to a vehicle specified under section 169.781, subdivision  10, paragraphs (c) and (d), provided that before driving the vehicle, a driver must determine  that the vehicle is in safe operating condition.\n"
    },
    "HF475": {
        "DESCRIPTION": "Bioincentive payment recipients additional information required.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0475&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "policy and finance \n, as well as the following information that the commissioner must require of each  producer who receives a payment during the reporting period:\n (1) the producer's business structure;\n (2) the name and address of the producer's parent company, if any;\n (3) a cumulative list of all financial assistance received from all grantors for the project;\n (4) goals for the number of jobs created and progress in achieving these goals, which  may include separate goals for the number of part-time or full-time jobs, or, in cases where  job loss is specific and demonstrable, goals for the number of jobs retained;\n (5) equity hiring goals and progress in achieving these goals;\n (6) wage goals and progress in achieving these goals for all jobs created or maintained  by the producer;\n (7) board member and executive compensation;\n (8) evidence of compliance with environmental permits;\n (9) the producer's intended and actual use of payments received from the commissioner;  and\n (10) if applicable, the latest financial audit opinion statement produced by a certified  public accountant in accordance with standards established by the American Institute of  Certified Public Accountants.\n"
    },
    "HF463": {
        "DESCRIPTION": "Rural Finance Authority funding provided, bonds issued, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0463&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "RURAL FINANCE AUTHORITY.\n Subdivision 1.\nAppropriation.\n$50,000,000 is appropriated from the bond proceeds  fund to the Rural Finance Authority for the purposes set forth in the Minnesota Constitution,  article XI, section 5, paragraph (h), to purchase participation interests in or to make direct  agricultural loans to farmers under Minnesota Statutes, chapter 41B. This appropriation is  from the bond proceeds account in the rural finance administration fund and is for the  beginning farmer program under Minnesota Statutes, section 41B.039; the loan restructuring  program under Minnesota Statutes, section 41B.04; the seller-sponsored program under  Minnesota Statutes, section 41B.042; the agricultural improvement loan program under  Minnesota Statutes, section 41B.043; and the livestock expansion loan program under  Minnesota Statutes, section 41B.045. All debt service on bond proceeds used to finance  this appropriation must be repaid by the Rural Finance Authority under Minnesota Statutes,  section 16A.643. Loan participations must be priced to provide full interest and principal  coverage and a reserve for potential losses. Priority for loans must be given first to basic  beginning farmer loans, second to seller-sponsored loans, and third to agricultural  improvement loans.\n Subd. 2.\nBond sale expenses.\n$50,000 is appropriated from the bond proceeds fund to  the commissioner of management and budget for bond sale expenses under Minnesota  Statutes, section 16A.641, subdivision 8.\n Subd. 3.\nBond sale.\nTo provide the money appropriated in this section from the bond  proceeds fund, the commissioner of management and budget shall sell and issue bonds of  the state in an amount up to $50,050,000 in the manner, upon the terms, and with the effect  prescribed by Minnesota Statutes, sections 16A.631 to 16A.675, and by the Minnesota  Constitution, article XI, sections 4 to 7.\n EFFECTIVE DATE.\nThis section is effective the day following final enactment.\n"
    },
    "HF269": {
        "DESCRIPTION": "Agricultural land, nonhomesteaded, noncommercial real property owners, and small business property owners allowed to vote on bonding and property tax questions where the property is located, implementing language provided, and constitutional amendment proposed.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0269&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "CONSTITUTIONAL AMENDMENT PROPOSED.\n An amendment to the Minnesota Constitution is proposed to the people. If the amendment  is adopted, article VII, section 1, will read:\nIn addition, every person 18 years of age  or more who has been a citizen of the United States and resident of this state for three months  and who is the owner of agricultural land or nonhomesteaded, noncommercial real property  or who is the owner of commercial or industrial real property and conducts on the property  a small business as defined by law may vote in the precinct where the real property is located  on any question concerning local levies or referendums. \nSUBMISSION TO VOTERS.\n The proposed amendment must be submitted to the people at the 2024 general election.  The question submitted must be:\n \"Shall the Minnesota Constitution be amended to allow the owner of agricultural land  or nonhomesteaded, noncommercial real property or the owner of commercial or industrial  real property who on that property conducts a small business as defined by law to vote on  local levies or referendums where the real property is located?\n\n \nYes \n.\n\n\n\n \nNo \n.\n\"\n\n\n[204B.50] CERTAIN PROPERTY TAX AND BOND QUESTIONS;  SECRETARY OF STATE RULES.\n The owner of agricultural land or nonhomesteaded, noncommercial real property or the  owner of commercial or industrial real property who conducts on that property a small  business as defined by law may vote in the precinct where the real property is located on  any question concerning local levies or referendums. Owners may register to vote in the  precinct, for purposes of these questions only, under procedures developed by the secretary  of state by rule. Owners may vote by absentee ballot in the manner provided by chapter  203B or may vote in a mail election as provided in section 204B.45.\nEFFECTIVE DATE.\n Section 3 is effective upon ratification of the amendment proposed in section 1.\n"
    },
    "HF207": {
        "DESCRIPTION": "Lawns to legumes grant program established, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0207&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "[103B.104] LAWNS TO LEGUMES PROGRAM.\n The Board of Water and Soil Resources may provide financial and technical assistance  to plant residential landscapes and community spaces with native vegetation and  pollinator-friendly forbs and legumes to protect a diversity of pollinators with declining  populations, providing additional benefits for water management, carbon sequestration, and  landscape resiliency. The board must establish criteria for grants or payments awarded under  this section. Grants or payments awarded under this section may give priority consideration  for proposals in areas identified by the United States Fish and Wildlife Service as areas  where there is a high potential for rusty patched bumble bees and other priority species to  be present. The board may collaborate with and enter into agreements with federal, state,  and local agencies; Tribal Nations; and other nonprofit organizations and contractors to  implement and promote the program.\nLAWNS TO LEGUMES; APPROPRIATION.\n $2,000,000 in fiscal year 2024 and $2,000,000 in fiscal year 2025 are appropriated from  the general fund to the Board of Water and Soil Resources for the lawns to legumes program  under Minnesota Statutes, section 103B.104. The board may enter into agreements with  local governments, Metro Blooms, and other organizations to support this effort.\n"
    },
    "HF127": {
        "DESCRIPTION": "Wolf and elk depredation payment funding provided, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0127&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "DEPREDATION PAYMENTS; APPROPRIATION.\n (a) $....... in fiscal year 2024 and $....... in fiscal year 2025 are appropriated from the  general fund to the commissioner of agriculture for compensation payments under Minnesota  Statutes, section 3.737, for livestock destroyed or crippled by wolves. If the amount in the  first year is insufficient, the amount in the second year is available in the first year. The  commissioner may use up to $5,000 of this appropriation each year to reimburse expenses  incurred by university extension agents to provide fair market values of destroyed or crippled  livestock.\n (b) $....... in fiscal year 2024 and $....... in fiscal year 2025 are appropriated from the  general fund to the commissioner of agriculture for compensation payments under Minnesota  Statutes, section 3.7371, for crop or fence damage caused by elk. If the amount in the first  year is insufficient, the amount in the second year is available in the first year.\n (c) If the commissioner determines that claims made under Minnesota Statutes, section  3.737 or 3.7371, are unusually high, the commissioner may transfer money appropriated  for either program to the appropriation for the other program.\n"
    },
    "HF103": {
        "DESCRIPTION": "Rural Finance Authority funding provided, bonds issued, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0103&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "RURAL FINANCE AUTHORITY.\n Subdivision 1.\nAppropriation.\n$50,000,000 is appropriated from the bond proceeds  fund to the Rural Finance Authority for the purposes set forth in the Minnesota Constitution,  article XI, section 5, paragraph (h), to purchase participation interests in or to make direct  agricultural loans to farmers under Minnesota Statutes, chapter 41B. This appropriation is  from the bond proceeds account in the rural finance administration fund and is for the  beginning farmer program under Minnesota Statutes, section 41B.039; the loan restructuring  program under Minnesota Statutes, section 41B.04; the seller-sponsored program under  Minnesota Statutes, section 41B.042; the agricultural improvement loan program under  Minnesota Statutes, section 41B.043; and the livestock expansion loan program under  Minnesota Statutes, section 41B.045. All debt service on bond proceeds used to finance  this appropriation must be repaid by the Rural Finance Authority under Minnesota Statutes,  section 16A.643. Loan participations must be priced to provide full interest and principal  coverage and a reserve for potential losses. Priority for loans must be given first to basic  beginning farmer loans, second to seller-sponsored loans, and third to agricultural  improvement loans.\n Subd. 2.\nBond sale expenses.\n$50,000 is appropriated from the bond proceeds fund to  the commissioner of management and budget for bond sale expenses under Minnesota  Statutes, section 16A.641, subdivision 8.\n Subd. 3.\nBond sale.\nTo provide the money appropriated in this section from the bond  proceeds fund, the commissioner of management and budget shall sell and issue bonds of  the state in an amount up to $50,050,000 in the manner, upon the terms, and with the effect  prescribed by Minnesota Statutes, sections 16A.631 to 16A.675, and by the Minnesota  Constitution, article XI, sections 4 to 7.\n EFFECTIVE DATE.\nThis section is effective the day following final enactment.\n"
    },
    "HF80": {
        "DESCRIPTION": "County agricultural inspector grant funding provided, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0080&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "APPROPRIATION.\n (a) $1,000,000 in fiscal year 2024 and $1,000,000 in fiscal year 2025 are appropriated  from the general fund to the commissioner of agriculture for grants to counties to support  county agricultural inspectors. The commissioner may use up to $130,000 of the appropriation  each year for administration.\n (b) To be eligible for grants under this section, a county must employ a county agricultural  inspector who:\n (1) has attended training for new county agricultural inspectors offered by the  commissioner;\n (2) coordinates with the commissioner to review applicable laws and enforcement  procedures;\n (3) compiles and submits to the commissioner local weed inspector annual report data;\n (4) conducts an annual meeting and training for local weed inspectors;\n (5) attends the annual short course of the Minnesota Association of County Agricultural  Inspectors; and\n (6) assists the commissioner with control programs and other agricultural programs  when requested under Minnesota Statutes, section 18.81, subdivision 1b.\n"
    },
    "HF70": {
        "DESCRIPTION": "Agricultural and food processing worker fair labor standard provisions modified.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0070&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": "181.86 to 181.88, \nor poultry processing \nAt the start of  employment, \n both\n and\n; and\n (6) the name of the employer's workers' compensation insurance carrier, the carrier's  phone number, and the insurance policy number.\n; and\n (4) the right to workers' compensation insurance coverage.\n (c) The requirements under this subdivision are in addition to the requirements under  section 181.032.\n Subd. 5.\nCivil action.\nAn employee injured by a violation of this section has a cause of  action for damages for the greater of $1,000 per violation or twice the employee's actual  damages, plus costs and reasonable attorney fees. A damage award shall be the greater of  $1,400 or three times actual damages for an employee injured by an intentional violation  of this section.\n Subd. 6.\nFine.\nThe commissioner of labor and industry shall fine an employer not less  than $400 or more than $1,000 for each violation of subdivision 3.\n three\nor within Minnesota \n  or of the possibility of employment\n(a) \nor another language if the person's  preferred language is not Spanish, \n three\n (b) The requirements under this subdivision are in addition to the requirements under  section 181.032.\n $1,000\n $1,400\n $400\n $1,000\n and additional languages  upon request\n, as well as labor performed in agriculture as defined in Minnesota  Rules, part 5200.0260\n an individual,  partnership, association, corporation, business trust, or any person or group of persons\n(a) \n, or another language if the  worker's preferred language is not Spanish\n; and\n (9) the name of the employer's workers' compensation insurance carrier, the carrier's  phone number, and the insurance policy number.\n (b) The requirements under this subdivision are in addition to the requirements under  section 181.032.\n unless payment is required sooner pursuant to section 181.13\nor state \n highest\n $16\n  The written statement shall also comply with all other requirements for an earnings statement  in section 181.032.\n for\n as required by section 177.30\n also maintain  the employment statements required under section 181.86\n $200\n $800\n $800\n $1,600\n $1,600\n Subd. 3.\nEnforcement.\nIn addition to any other remedies available, the commissioner  may assess the penalties in subdivision 2 and provide the penalty to the migrant worker  aggrieved by the employer's noncompliance.\n"
    },
    "HF47": {
        "DESCRIPTION": "Pollinator research funding provided, money transferred, and money appropriated.",
        "BILL_URL": "www.revisor.mn.gov/bills/text.php?number=HF0047&session=ls93&version=list&session_number=0&session_year=2023",
        "BILL_TEXT": ":\n (1) pesticide\n parasite, and climate disruption impacts;\n (2)\n;\n (3)\nTRANSFER.\n $....... in fiscal year 2024 is transferred from the general fund to the pollinator research  account established under Minnesota Statutes, section 18B.051.\n"
    }
}